# author: C.C.
# contact: 3280766842@qq.com
# datetime:2021/2/22 13:23
# software: PyCharm

"""
文件说明：

“[]”标识列表。有序列。
里面可以有各种元素类型。
且元素可以任意修改。
[1,2,3,4,5,6,"ssss"]

"""

list = [1,2,3,4,5,6,"ssss"]


# 追加


# 插入

# 合并 extend

# 列表嵌套 [1,2,[3,4,5],6,7]


# 删除 pop（索引） 。默认删除最后，可以指定删除哪个。

# 删除 remove(元素)

# 清空 clear


#-----------------

# 查找操作
# 返回索引值 index("元素名")
# 返回元素个数 count("元素名")


#------------------------------------------
# 切片（顾头不顾尾） list[1:3] , 负数为倒着切，默认从左到右切
#------------------------------------------

list[0:3] # 等价 list[:3] , 0可以省略

list[3:] # 等有价从3号索引到末尾。


# 切片 步长 [start:stop:step-步长]

# 切片 排序（sort）
# 切片 反转（reverse）

# 列表索引，使用 枚举类型
